[
  {
    "id": 1,
    "slug": "stickers-logo-la-harde",
    "name": "Stickers Logo LA HARDE",
    "price": 5.99,
    "description": "Pack de 5 stickers avec le logo officiel des Sangliers atomiques. Résistants à l'eau et aux UV.",
    "fullDescription": "Pack de 5 stickers haute qualité avec le logo officiel de LA HARDE - Les Sangliers atomiques. Ces autocollants sont parfaits pour personnaliser votre vélo, casque, gourde ou tout autre équipement. Fabrication en vinyle premium résistant à l'eau, aux UV et aux intempéries. Dimensions variées de 5cm à 15cm. Adhésif longue durée qui ne laisse pas de traces.",
    "image": "/images/products/stickers.png",
    "images": [
      "/images/products/stickers.png",
      "/images/products/stickers-2.png",
      "/images/products/stickers-3.png"
    ],
    "category": "Accessoires",
    "stock": 150,
    "sizes": [],
    "colors": ["Multicolore"]
  },
  {
    "id": 2,
    "slug": "maillot-officiel-la-harde",
    "name": "Maillot Officiel LA HARDE",
    "price": 89.99,
    "description": "Maillot cycliste officiel de l'équipe. Tissu respirant, coupe aérodynamique. Disponibles tailles S à XXL.",
    "fullDescription": "Le maillot officiel de l'équipe LA HARDE - Les Sangliers atomiques. Conçu avec des matériaux techniques de haute performance : tissu respirant évacuant l'humidité, coupe aérodynamique ergonomique, fermeture éclair YKK intégrale, 3 poches arrière spacieuses, et bande silicone anti-remontée. Sublimation complète pour des couleurs durables qui ne se délavent pas. Parfait pour vos sorties et compétitions.",
    "image": "/images/products/maillot.png",
    "images": [
      "/images/products/maillot.png",
      "/images/products/maillot-2.png",
      "/images/products/maillot-3.png",
      "/images/products/maillot-4.png"
    ],
    "category": "Vêtements",
    "stock": 45,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "colors": ["Bordeaux/Beige"]
  },
  {
    "id": 3,
    "slug": "mug-les-sangliers-explosifs",
    "name": "Mug Les Sangliers Explosifs",
    "price": 14.99,
    "description": "Mug en céramique 350ml avec logo de l'équipe. Passe au lave-vaisselle et micro-ondes.",
    "fullDescription": "Mug en céramique de qualité supérieure avec le logo emblématique des Sangliers atomiques. Capacité de 350ml, idéal pour votre café ou thé du matin avant vos sorties vélo. Impression haute définition résistante, compatible lave-vaisselle et micro-ondes. Design ergonomique avec anse confortable. Un cadeau parfait pour tout fan de cyclisme et supporter de LA HARDE.",
    "image": "/images/products/mug.png",
    "images": [
      "/images/products/mug.png",
      "/images/products/mug-2.png"
    ],
    "category": "Accessoires",
    "stock": 80,
    "sizes": ["350ml"],
    "colors": ["Bordeaux"]
  },
  {
    "id": 4,
    "slug": "veste-coupe-vent-la-harde",
    "name": "Veste Coupe-Vent LA HARDE",
    "price": 129.99,
    "description": "Veste technique coupe-vent aux couleurs de l'équipe. Légère et compactable. Parfaite pour les sorties matinales.",
    "fullDescription": "Veste coupe-vent technique professionnelle aux couleurs officielles de LA HARDE. Ultra-légère et compactable, elle se range facilement dans une poche de maillot. Tissu déperlant traité DWR, panneaux ventilés sous les bras, col montant pour protection optimale, fermeture éclair complète avec garage de tirette. Bandes réfléchissantes pour visibilité nocturne. Indispensable pour les sorties matinales et les descentes de col.",
    "image": "/images/products/veste.png",
    "images": [
      "/images/products/veste.png",
      "/images/products/veste-2.png",
      "/images/products/veste-3.png"
    ],
    "category": "Vêtements",
    "stock": 30,
    "sizes": ["S", "M", "L", "XL", "XXL"],
    "colors": ["Bordeaux/Beige"]
  },
  {
    "id": 5,
    "slug": "casque-pro-team-la-harde",
    "name": "Casque Pro Team LA HARDE",
    "price": 199.99,
    "description": "Casque aérodynamique aux couleurs de l'équipe. Certifié CE, système de ventilation optimisé.",
    "fullDescription": "Casque route haute performance aux couleurs de LA HARDE - Les Sangliers atomiques. Design aérodynamique avec 18 ouvertures de ventilation optimisées pour un flux d'air maximal. Construction in-mold ultra-légère (230g en taille M), système de réglage micrométrique pour ajustement parfait, mousses intérieures antibactériennes amovibles et lavables. Conforme aux normes de sécurité CE EN 1078. Livré avec housse de protection.",
    "image": "/images/products/casque.png",
    "images": [
      "/images/products/casque.png"
    ],
    "category": "Équipement",
    "stock": 20,
    "sizes": ["S (52-56cm)", "M (56-60cm)", "L (60-64cm)"],
    "colors": ["Bordeaux/Beige"]
  },
  {
    "id": 6,
    "slug": "bidon-officiel-750ml",
    "name": "Bidon Officiel 750ml",
    "price": 12.99,
    "description": "Bidon d'hydratation 750ml avec logo LA HARDE. Sans BPA, compatible lave-vaisselle.",
    "fullDescription": "Bidon d'hydratation officiel LA HARDE en plastique alimentaire sans BPA. Capacité de 750ml pour vos longues sorties. Valve auto-obturante anti-fuite, goulot large pour remplissage facile et ajout de glaçons, compatible avec tous les porte-bidons standard. Matériau souple pour extraction facile du liquide. Logo sérigraphié haute résistance. Compatible lave-vaisselle (panier supérieur). Fabrication européenne.",
    "image": "/images/products/bidon.png",
    "images": [
      "/images/products/bidon.png"
    ],
    "category": "Accessoires",
    "stock": 100,
    "sizes": ["750ml"]
  }
]
